sprindy/yyb/rtos/nrf51822/beacon/nrf51_beacon/ble_app_beacon/drivers/display/display.c
			}
		log_d("[DISP] cnt:%d, display_acc_cnt:%d, static:%d.\n", cnt, display_acc_cnt, cnt_static);
#endif
			display_work();
#endif
            break;
        default: break;
    }
}

static uint32_t display_drv_timer_init(void)
{
    uint32_t time_us = display_hw_timer_period; //Time between consecutive compare events.
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&TIMER_LED, &timer_cfg, timer_led_event_handler);
	APP_ERROR_CHECK(err_code);
	if(err_code == NRF_SUCCESS) {
		display_hw_timer_running = true;
		log_d("[DISP] %s success.\n", __func__);
	}

    time_ticks = nrf_drv_timer_us_to_ticks(&TIMER_LED, time_us);

    nrf_drv_timer_extended_compare(
         &TIMER_LED, NRF_TIMER_CC_CHANNEL1, time_ticks, NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, true);

    nrf_drv_timer_enable(&TIMER_LED);

	return err_code;
}

uint32_t display_init(beacon_flash_db_t *pdata)
{
	uint32_t err_code;

	nrf_gpio_cfg_output(DISPLAY_GPIO_0);
	nrf_gpio_cfg_output(DISPLAY_GPIO_1);
	nrf_gpio_cfg_output(DISPLAY_GPIO_2);
	nrf_gpio_cfg_output(DISPLAY_GPIO_3);
	nrf_gpio_cfg_output(DISPLAY_GPIO_4);
	nrf_gpio_cfg_output(DISPLAY_GPIO_5);
	nrf_gpio_cfg_output(DISPLAY_GPIO_6);
	nrf_gpio_cfg_output(DISPLAY_GPIO_7);

	nrf_gpio_pin_clear(DISPLAY_GPIO_0);
	nrf_gpio_pin_clear(DISPLAY_GPIO_1);
	nrf_gpio_pin_clear(DISPLAY_GPIO_2);
	nrf_gpio_pin_clear(DISPLAY_GPIO_3);
	nrf_gpio_pin_clear(DISPLAY_GPIO_4);
	nrf_gpio_pin_clear(DISPLAY_GPIO_5);
	nrf_gpio_pin_clear(DISPLAY_GPIO_6);
	nrf_gpio_pin_clear(DISPLAY_GPIO_7);

	/* set default value */
	pdata->yyb_data.display_timer_period = 0x2000;
	display_timer_period = pdata->yyb_data.display_timer_period;
	if((0xffffffff == display_timer_period) || (0 == display_timer_period)) {
		display_timer_period = 0x2000;
	}
	display_words_num = pdata->yyb_data.display_words_num;
	log_d("[DISP] display words num:%d\n", display_words_num);
	display_enable_hw_timer = pdata->yyb_data.display_enable_hw_timer;
	log_d("[DISP] display_enable_hw_timer:0x%x\n", display_enable_hw_timer);
	if(display_enable_hw_timer) {
		display_hw_timer_period = pdata->yyb_data.display_hw_timer_period;
		if((0xffffffff == display_hw_timer_period) || (30 >= display_hw_timer_period)) {
			display_hw_timer_period = 40;
		}
		log_d("[DISP] display hw timer period:%d\n", display_hw_timer_period);

		display_line_delay = pdata->yyb_data.display_line_delay;
		log_d("[DISP] display line delay:%d\n", display_line_delay);
		err_code = display_drv_timer_init();
	}

	else if(DISPLAY_WORDS_ZERO_FOR_TEST == display_words_num) {
		err_code = display_timer_init();
		if(err_code == NRF_SUCCESS) {
			err_code = display_timer_start();
		}
	}
	return err_code;
}
